app/Controllers/DosenPembimbing.php

SELECT *
FROM `fip_dosen`
---
    public function tambah_skripsi()
    {
        $data = [
            'judul' => 'Ajukan Skripsi',
            'nim' => session()->get('nim'),
            'nama' => session()->get('nama_asli'),
            'dosen' => $this->dosenModel->getAll(),
        ];