app/Controllers/Skripsi.php

    public function index()
    {
        $semuaSkripsi = $this->skripsiModel->findAll();
---
SELECT *
FROM `skripsi`

    public function simpan_skripsi()
    {
        $this->skripsiModel->save([
            'nama_mahasiswa' => $this->request->getVar('nama_mahasiswa'),
            'nim_mahasiswa' => $this->request->getVar('nim_mahasiswa'),
            'periode_pengajuan' => $this->request->getVar('periode_pengajuan'),
            'tahun_pengajuan' => $this->request->getVar('tahun_pengajuan'),
            'judul_skripsi' => $this->request->getVar('judul_skripsi'),
            'deskripsi_skripsi' => $this->request->getVar('deskripsi_skripsi'),
            'konsentrasi_bidang' => $this->request->getVar('konsentrasi_bidang'),
            'nama_pembimbing' => $this->request->getVar('nama_pembimbing'),
            'nama_dosen_pa' => $this->request->getVar('nama_dosen_pa'),
            'status_pengajuan_skripsi' => 1,
        ]);
---
INSERT INTO `skripsi` (`nama_mahasiswa`, `nim_mahasiswa`, `periode_pengajuan`, `tahun_pengajuan`, `judul_skripsi`, `deskripsi_skripsi`, `konsentrasi_bidang`, `nama_pembimbing`, `nama_dosen_pa`, `status_pengajuan_skripsi`, `created_at`, `updated_at`) VALUES ('Joyboy Saputra', '20302010', '1', '2023', 'Ini judul skripsi saya', 'ini deskripsi skripsi saya', 'ini konsentrasi bidang saya', 'Prof. Ardipal', 'Prof. Indrayuda', 1, '2023-10-18 01:53:43', '2023-10-18 01:53:43')

    public function edit_skripsi($id)
    {
        $data = [
            'judul' => 'Edit Skripsi',
            'single_skripsi' => $this->skripsiModel->find($id)
        ];
---
SELECT *
FROM `skripsi`
WHERE `skripsi`.`skripsi_id` = '5'

    public function simpan_edit_skripsi()
    {
        $this->skripsiModel->save([
            'nama_mahasiswa' => $this->request->getVar('nama_mahasiswa'),
            'nim_mahasiswa' => $this->request->getVar('nim_mahasiswa'),
            'periode_pengajuan' => $this->request->getVar('periode_pengajuan'),
            'tahun_pengajuan' => $this->request->getVar('tahun_pengajuan'),
            'judul_skripsi' => $this->request->getVar('judul_skripsi'),
            'deskripsi_skripsi' => $this->request->getVar('deskripsi_skripsi'),
            'konsentrasi_bidang' => $this->request->getVar('konsentrasi_bidang'),
            'nama_pembimbing' => $this->request->getVar('nama_pembimbing'),
            'nama_dosen_pa' => $this->request->getVar('nama_dosen_pa'),
            'status_pengajuan_skripsi' => 1,
        ]);
---
INSERT INTO `skripsi` (`nama_mahasiswa`, `nim_mahasiswa`, `periode_pengajuan`, `tahun_pengajuan`, `judul_skripsi`, `deskripsi_skripsi`, `konsentrasi_bidang`, `nama_pembimbing`, `nama_dosen_pa`, `status_pengajuan_skripsi`, `created_at`, `updated_at`) VALUES ('Endra Ulkri Arma', '20103020', 'Pilih Periode', '2023', 'Ini Judul Skripsi Saya', 'Ini deskripsi dari skripsi saya', 'Ini konsentrasi Bidang yang saya ambilsdfsdf', 'Endra Ulkri Arma', '', 1, '2023-10-16 15:14:04', '2023-10-16 15:14:04')