app/Controllers/Skripsi.php

INSERT INTO `histori_skripsi` (`histori_skripsi_id`, `histori_nim`, `histori_status`, `histori_keterangan`, `created_at`, `updated_at`) VALUES (0, '22321928', 1, 'pengajuan judul', '2023-11-15 21:58:58', '2023-11-15 21:58:58')
---
            'status_pengajuan_skripsi' => 1,
        ]);
        $skripsi_id = $this->skripsiModel->getInsertID();
        $this->historiModel->save([
            'histori_skripsi_id' => $skripsi_id,
            'histori_nim' => $this->request->getVar('nim_mahasiswa'),
            'histori_status' => 1,
            'histori_keterangan' => 'pengajuan judul'
        ]);