app/Models/BimbinganModel.php

SELECT `bimbingan`.*, `skripsi`.*
FROM `bimbingan`
JOIN `skripsi` ON `bimbingan`.`bb_skripsi_id` = `skripsi`.`skripsi_id`
WHERE `nim_mahasiswa` = '22321928'
---
    public function getAll($nim = null)
    {
        $builder = $this->db->table('bimbingan');
        $builder->select('bimbingan.*,skripsi.*');
        $builder->join('skripsi', 'bimbingan.bb_skripsi_id = skripsi.skripsi_id');
        if($nim) {
            $builder->where('nim_mahasiswa', $nim);
        }
        $query = $builder->get();