app/Models/DosenModel.php

SELECT *
FROM `fip_dosen`
ORDER BY `peg_nama` ASC
---
    public function getAll()
    {

        // $sql = 'SELECT *,  FROM fip_dosen ';
        // $dosen = $this->db->query($sql);
        // dd($dosen->getResult());

        return $this->db->table('fip_dosen')
        ->orderBy('peg_nama','ASC')->get()->getResult();