app/Models/SkripsiModel.php

    public function getAll($nim = null)
    {
        $builder = $this->db->table('skripsi');
        $builder->select('skripsi.*,
        fip_dosen_pembimbing.nidn as d_pembimbing_nidn, fip_dosen_pembimbing.peg_gel_dep as d_pembimbing_peg_gel_dep, fip_dosen_pembimbing.peg_nama as d_pembimbing_peg_nama, fip_dosen_pembimbing.peg_gel_bel as d_pembimbing_peg_gel_bel,
        fip_dosen_pa.nidn as d_pa_nidn, fip_dosen_pa.peg_gel_dep as d_pa_peg_gel_dep, fip_dosen_pa.peg_nama as d_pa_peg_nama, fip_dosen_pa.peg_gel_bel as d_pa_peg_gel_bel');
        $builder->join('fip_dosen as fip_dosen_pembimbing', 'fip_dosen_pembimbing.nidn = skripsi.dosen_pembimbing');
        $builder->join('fip_dosen as fip_dosen_pa', 'fip_dosen_pa.nidn = skripsi.dosen_pa');
        if($nim) {
            $builder->where('nim_mahasiswa', $nim);
        }
        $builder->groupStart();
        $builder->where('status_pengajuan_skripsi', '1');
        $builder->orWhere('status_pengajuan_skripsi', '2');
        $builder->orWhere('status_pengajuan_skripsi', '3');
        $builder->groupEnd();
        $query = $builder->get();
---
SELECT `skripsi`.*, `fip_dosen_pembimbing`.`nidn` as `d_pembimbing_nidn`, `fip_dosen_pembimbing`.`peg_gel_dep` as `d_pembimbing_peg_gel_dep`, `fip_dosen_pembimbing`.`peg_nama` as `d_pembimbing_peg_nama`, `fip_dosen_pembimbing`.`peg_gel_bel` as `d_pembimbing_peg_gel_bel`, `fip_dosen_pa`.`nidn` as `d_pa_nidn`, `fip_dosen_pa`.`peg_gel_dep` as `d_pa_peg_gel_dep`, `fip_dosen_pa`.`peg_nama` as `d_pa_peg_nama`, `fip_dosen_pa`.`peg_gel_bel` as `d_pa_peg_gel_bel`
FROM `skripsi`
JOIN `fip_dosen` as `fip_dosen_pembimbing` ON `fip_dosen_pembimbing`.`nidn` = `skripsi`.`dosen_pembimbing`
JOIN `fip_dosen` as `fip_dosen_pa` ON `fip_dosen_pa`.`nidn` = `skripsi`.`dosen_pa`
WHERE `nim_mahasiswa` = '22321928'
AND   (
`status_pengajuan_skripsi` = '1'
OR `status_pengajuan_skripsi` = '2'
OR `status_pengajuan_skripsi` = '3'
 )

    public function simpanSkripsi($data)
    {
        $builder = $this->db->table('skripsi');
        $builder->set('skripsi_uuid','UUID()', FALSE);
        $builder->insert($data);
---
INSERT INTO `skripsi` (`skripsi_uuid`, `nama_mahasiswa`, `nim_mahasiswa`, `periode_pengajuan`, `tahun_pengajuan`, `judul_skripsi`, `deskripsi_skripsi`, `konsentrasi_bidang`, `dosen_pembimbing`, `dosen_pa`, `data_dukung`, `status_pengajuan_skripsi`) VALUES (UUID(), 'Aprinaldo', '22321928', '2', '2024', 'judul skripsi terbaru 2024', 'deskripsi skripsi terbaru 2024', 'konsentrasi skripsi terbaru 2024', '0020055410', '0031016108', '(final) hasil pendaftaran asrama_2.pdf', 1)

    public function getJudulDiterima($nim = null)
    {
        $builder = $this->db->table('skripsi');
        $builder->select('skripsi.*,
        fip_dosen_pembimbing.nidn as d_pembimbing_nidn, fip_dosen_pembimbing.peg_gel_dep as d_pembimbing_peg_gel_dep, fip_dosen_pembimbing.peg_nama as d_pembimbing_peg_nama, fip_dosen_pembimbing.peg_gel_bel as d_pembimbing_peg_gel_bel,
        fip_dosen_pa.nidn as d_pa_nidn, fip_dosen_pa.peg_gel_dep as d_pa_peg_gel_dep, fip_dosen_pa.peg_nama as d_pa_peg_nama, fip_dosen_pa.peg_gel_bel as d_pa_peg_gel_bel');
        $builder->join('fip_dosen as fip_dosen_pembimbing', 'fip_dosen_pembimbing.nidn = skripsi.dosen_pembimbing');
        $builder->join('fip_dosen as fip_dosen_pa', 'fip_dosen_pa.nidn = skripsi.dosen_pa');
        if($nim) {
            $builder->where('nim_mahasiswa', $nim);
        }
        $builder->where('status_pengajuan_skripsi', '3');
        $query = $builder->get();
---
SELECT `skripsi`.*, `fip_dosen_pembimbing`.`nidn` as `d_pembimbing_nidn`, `fip_dosen_pembimbing`.`peg_gel_dep` as `d_pembimbing_peg_gel_dep`, `fip_dosen_pembimbing`.`peg_nama` as `d_pembimbing_peg_nama`, `fip_dosen_pembimbing`.`peg_gel_bel` as `d_pembimbing_peg_gel_bel`, `fip_dosen_pa`.`nidn` as `d_pa_nidn`, `fip_dosen_pa`.`peg_gel_dep` as `d_pa_peg_gel_dep`, `fip_dosen_pa`.`peg_nama` as `d_pa_peg_nama`, `fip_dosen_pa`.`peg_gel_bel` as `d_pa_peg_gel_bel`
FROM `skripsi`
JOIN `fip_dosen` as `fip_dosen_pembimbing` ON `fip_dosen_pembimbing`.`nidn` = `skripsi`.`dosen_pembimbing`
JOIN `fip_dosen` as `fip_dosen_pa` ON `fip_dosen_pa`.`nidn` = `skripsi`.`dosen_pa`
WHERE `nim_mahasiswa` = '22321928'
AND `status_pengajuan_skripsi` = '3'

    public function getIdSkripsiUntukBimbingan($nim = null)
    {
        $builder = $this->db->table('skripsi');
        $builder->select('skripsi.skripsi_id as skripsi_id');
        $builder->where('nim_mahasiswa', $nim);
        $builder->where('status_pengajuan_skripsi', '3');
        $query = $builder->get();
---
SELECT `skripsi`.`skripsi_id` as `skripsi_id`
FROM `skripsi`
WHERE `nim_mahasiswa` = '22321928'
AND `status_pengajuan_skripsi` = '3'

    public function cekBisaTambahSkripsi()
    {
        $nim  = session()->get('nim');
        $builder = $this->db->table('skripsi');
        $builder->where('nim_mahasiswa', $nim);
        $builder->groupStart();
        $builder->where('status_pengajuan_skripsi', '1');
        $builder->orWhere('status_pengajuan_skripsi', '3');
        $builder->groupEnd();
        $query = $builder->get();
---
SELECT *
FROM `skripsi`
WHERE `nim_mahasiswa` = '22321928'
AND   (
`status_pengajuan_skripsi` = '1'
OR `status_pengajuan_skripsi` = '3'
 )

    public function cekBisaBimbingan()
    {
        $nim  = session()->get('nim');
        $builder = $this->db->table('skripsi');
        $builder->where('nim_mahasiswa', $nim);
        $builder->where('status_pengajuan_skripsi', '3');
        $query = $builder->get();
---
SELECT *
FROM `skripsi`
WHERE `nim_mahasiswa` = '22321928'
AND   (
`status_pengajuan_skripsi` = '1'
OR `status_pengajuan_skripsi` = '3'
 )